
## Plan Result (terraform/mgmt/vpc)

[CI link](https://github.com/mileslee-nsuslab/tfaction-example/actions/runs/6009030164)


<pre><code>Plan: 5 to add, 3 to change, 0 to destroy.</code></pre>

* Create
  * module.vpc.aws_nat_gateway.this[0]
  * module.vpc.aws_route_table_association.private[0]
  * module.vpc.aws_route_table_association.public[0]
  * module.vpc.aws_subnet.private[0]
  * module.vpc.aws_subnet.public[0]
* Update
  * module.vpc.aws_eip.nat[0]
  * module.vpc.aws_route.private_nat_gateway[0]
  * module.vpc.aws_route_table.private[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.vpc.aws_eip.nat[0] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-02ef315b3aada2768"
      ~ tags                 = {
            "Environment" = "prod"
          ~ "Name"        = "my-vpc-eu-west-1a" -> "my-vpc-us-east-1a"
            "Terraform"   = "true"
        }
      ~ tags_all             = {
          ~ "Name"        = "my-vpc-eu-west-1a" -> "my-vpc-us-east-1a"
            # (2 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = "eipalloc-02ef315b3aada2768"
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Environment" = "prod"
          + "Name"        = "my-vpc-us-east-1a"
          + "Terraform"   = "true"
        }
      + tags_all                           = {
          + "Environment" = "prod"
          + "Name"        = "my-vpc-us-east-1a"
          + "Terraform"   = "true"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be updated in-place
  ~ resource "aws_route" "private_nat_gateway" {
        id                     = "r-rtb-089883fb520b48fff1080289494"
      ~ nat_gateway_id         = "nat-041693a73ccbebefa" -> (known after apply)
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-089883fb520b48fff"
      ~ tags             = {
            "Environment" = "prod"
          ~ "Name"        = "my-vpc-private-eu-west-1a" -> "my-vpc-private-us-east-1a"
            "Terraform"   = "true"
        }
      ~ tags_all         = {
          ~ "Name"        = "my-vpc-private-eu-west-1a" -> "my-vpc-private-us-east-1a"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = "rtb-089883fb520b48fff"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = "rtb-033a16cc0803487f5"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "prod"
          + "Name"        = "my-vpc-private-us-east-1a"
          + "Terraform"   = "true"
        }
      + tags_all                                       = {
          + "Environment" = "prod"
          + "Name"        = "my-vpc-private-us-east-1a"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = "vpc-04a33a2200ed6e4c4"
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.101.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "prod"
          + "Name"        = "my-vpc-public-us-east-1a"
          + "Terraform"   = "true"
        }
      + tags_all                                       = {
          + "Environment" = "prod"
          + "Name"        = "my-vpc-public-us-east-1a"
          + "Terraform"   = "true"
        }
      + vpc_id                                         = "vpc-04a33a2200ed6e4c4"
    }

Plan: 5 to add, 3 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":56,"Program":"tfcmt","SHA1":"95f98499f161fc4c6e031fbff5a5f8af72892b99","Target":"terraform/mgmt/vpc","Vars":{},"WorkflowName":"test"} -->